'''
У зоопарк прибули нові тварини. Доглядач зоопарку стурбований тим, що, можливо, у тварин не ті хвости.
Щоб допомогти їй, ви повинні виправити несправну функцію, щоб переконатися,
що другий аргумент (хвіст) збігається з останньою літерою першого аргументу (тіло) - інакше хвіст не поміститься!
Якщо хвіст правильний, повертає true, інакше повертає false.

Аргументами завжди будуть непорожні рядки та звичайні літери.
'''


def correct_tail(body, tail):
    sub = body[len(body) - len(tail):]
    if sub == tail:
        return True
    else:
        return False

