'''Ви були в таборі з друзями далеко від дому, але коли прийшов час повертатися, ви розумієте, що ваше паливо закінчується,
а найближча заправка знаходиться за 50 миль!
Ви знаєте, що в середньому ваш автомобіль проїжджає приблизно 25 миль на галон.
Залишилося 2 галони.
Враховуючи ці фактори, напишіть функцію, яка повідомляє вам, чи можна дістатися до насоса чи ні.
Функція має повертати true, якщо це можливо, і false, якщо ні.
'''

def zero_fuel(distance_to_pump, mpg, fuel_left):
    if fuel_left >= distance_to_pump/mpg:
        return True
    else:
        return False